/*
C 部落冲突
分数 15
作者 QQ
单位 绍兴理工学院
在一个神秘的岛屿上，有两个部落 A 和 B，部落 A 和 B 之间有一片平原。这片平原上有许多的绿洲，每个绿洲可以看做一个矩形，其边平行于坐标轴。为了避免部落之间的冲突，他们需要在平原上划定一个界线来平均分配这些绿洲。岛屿上的酋长决定让你来帮助他们找到一个公平的划分方法。

具体来说，酋长想要你将这片平原分成两部分，分别归属于部落 A 和 B。划分的界线需要平行于 y 轴，并且可以通过坐标轴上的一个整数点来确定。具体来说，如果界线通过整数点 x，则所有在 x 左边的土地归属于部落 A，所有在 x 右边的土地归属于部落 B。划分的要求如下：

两部分的绿洲面积尽可能接近。

部落 A 的绿洲面积应该不小于部落 B 的绿洲面积

现在，请你求出岛屿的分界线x因该在那里，以此来避免部落冲突。

输入格式:
第一行是一个正整数 n，表示这片平原上有 n 个绿洲。 接下来 n 行，每行描述一个绿洲，包含 4 个整数 x, y, w, h，表示这个绿洲的左上角坐标为 (x, y)，宽度为 w，高度为 h。保证所有绿洲不会重叠，且所有的坐标、宽度、高度都不超过 1,000,000。

数据范围（1<=n<=100)

输出格式:
对于每组测试数据，输出一个整数 x，表示划分界线的坐标应该为 x。

输入样例:
在这里给出一组输入。例如：

1
0 0 100 100
输出样例:
在这里给出相应的输出。例如：

50
*/