/*
7-2 Captain-G's “Die Hard”
分数 10
作者 李佳
单位 重庆大学
计科系葛队长特别喜欢看“Die Hard III”（中文名：龙胆虎威3）这部经典的反恐（其实是抓强盗！）电影。影片中有一个精彩片段：犯人在街心公园设置了定时Z弹，并且安装在电子秤里面，需要把重量刚好等于4加仑水的重物放在秤上才能解除，但是现场只有两个水壶可用，且容量分别是5加仑和3加仑。在电影里面，主人公（布鲁斯·威利斯饰）在黑人店主的帮助下，用这两个水壶就精确量出了4加仑的水，成功解除了炸弹。葛队长对这个场景印象深刻，于是出了一道编程题来考考你。
问题：给定两个容量不同的水壶，问只用这两个水壶能否“精准”测出一定量的水。精准测量是指在容量较大的水壶中刚好装进指定量的水。同时，由于水壶都没有刻度，能够执行的操作如下：
直接装满任意一个水壶
直接倒空任意一个水壶
将水从一个水壶倒入另一个水壶，直到接水的壶装满（不能溢出），或倒水的壶清空。
输入格式:
输入有三行。第一行给出了两个正整数X和Y，分别表示两个水壶的容量 (1≤Y<X<2000)；
第二行给出一个正整数K，表示测量次数 (1≤K≤1000)；
接下来一行包含K个整数w 
1
​
 ,…,w 
K
​
 ，数字间用空格分开。其中，w 
i
​
 表示第i次需要测的水量 (1≤i≤K)，满足0≤w 
i
​
 ≤X。

输出格式:
在一行中输出K个0或1。如果用两个水壶能够测出量为w 
i
​
 的水，则输出的第i个数字为1；否则输出0。简单起见，每个数字后面都留一个空格，包括末尾的数字。

输入样例1:
5 3
6
0 1 2 3 4 5
输出样例1:
1 1 1 1 1 1 
*/
#include<iostream>
#include<vector>
using namespace std;
int gcd(int a,int b){
    while(b!=0){
        int temp=a%b;
        a=b;
        b=temp;
    }
    return a;
}
int main(){
    int x,y,k;
    cin>>x>>y>>k;
    vector<int> ce,pan(k,0);
    for(int i=0;i<k;i++){
        int n;
        cin>>n;
        ce.push_back(n);
    }
    int yue=gcd(x,y);
    for(int i=0;i<k;i++){
        if(ce[i]%yue==0){
            pan[i]=1;
        }
        cout<<pan[i]<<" ";
    }
    cout<<endl;
}