/*
F 乘x乘
分数 20
作者 李佳
单位 重庆大学
给定一组整数值和正整数q，重复以下操作K次：每次从序列中选出最小值并乘以q，如果最小值不止一个，则选择位置最靠前（下标最小）的数值。最后按序输出每个数值乘以q的次数。

输入格式:
输入在第一行中给出3个正整数n,q,K (1≤n≤2∗10 
4
 ，1<q≤10 
3
 ，1≤K≤10 
9
 )。
接下来一行给出n个整数值，表示输入序列，所有数值都在区间[1,10 
9
 ]以内，数值间用空格分开。

输出格式:
在一行中输出n个数值，第i (1≤i≤n) 个值表示输入序列的第i个数乘以q的次数。相邻数值间用空格分开，末尾的数值后面没有空格。

提示：
假设初始序列为a 
0
​
 ,a 
1
​
 ,…,a 
n−1
​
 ，K次乘法运算后的序列可以表示成a 
0
​
 q 
k 
0
​
 
 ,…,a 
i
​
 q 
k 
i
​
 
 ,…,a 
n−1
​
 q 
k 
n−1
​
 
 ，满足k 
i
​
 ≥0且∑ 
i=0
n−1
​
 k 
i
​
 =K。
需要注意的是当a 
i
​
 , q和k 
i
​
 的值较大时，a 
i
​
 q 
k 
i
​
 
 可能超出（32位或64位）整数值范围。为此，一种简便的方法是用四元组<a 
i
​
 ,q,k 
i
​
 ,i>记录a 
i
​
 q 
k 
i
​
 
 ，然后用相应的结构体(struct)或类(class)存储。
这种情况下，如何比较<a 
i
​
 ,q,k 
i
​
 ,i>和<a 
j
​
 ,q,k 
j
​
 ,j> 的大小？例如当k 
i
​
 ≥k 
j
​
 , 可以通过比较a 
i
​
 q 
k 
i
​
 −k 
j
​
 
 与a 
j
​
 来判断。
输入样例:
5 3 5
3 1 4 2 5
（注）本题共有6个测试用例

在1/3的测试用例中，1≤n,K≤10 
3
 ，并且乘法运算后的数值都不超出整数值范围；
在2/3的测试用例中，K≤2∗10 
5
 。
输出样例:
1 2 1 1 0
（注）
第一次乘3：3 3 4 2 5
第二次乘3:   3 3 4 6 5
第三次乘3：9 3 4 6 5
第四次乘3：9 9 4 6 5
第五次乘3：9 9 12 6 5
*/