/*
G 落叶归根
分数 20
作者 Bright
单位 重庆大学
李老师让陈同学生产一道关于树的题目，于是这道题就应运而生了。

给定一棵深度为 n 的完美三叉树（共 n 层，每一层的结点都填满的三叉树），按照层序遍历的顺序，对结点进行从 1∼ 
2
3 
n
 −1
​
  进行编号，其中根节点的编号为 1 。

下面要进行m次操作：每次操作给定一个正整数x，并删除以编号为x的结点为根结点的子树（如果编号为x的结点此时已经不存在了，那么这次操作是无效的，即对整棵树不产生任何影响）。你的任务是输出在每次操作之后，这棵树还剩下多少个结点。

请注意，每次操作之间不是独立的，即操作的影响是持久的，每一次操作都会对后面的情况产生影响。

输入格式:
第一行两个正整数 n,m(1≤n≤25,1≤m≤2×10 
5
 ) ，分别表示完美三叉树的深度和操作的次数。

随后 m 行，每行一个正整数 x(1≤x≤ 
2
3 
n
 −1
​
 ) ，表示要删除的结点的编号。

输出格式:
对于每一次操作，输出一行一个正整数，表示这次操作之后整棵树中剩余的结点数。

输入样例:
在这里给出一组输入。例如：

3 4
13
4
11
3
输出样例:
在这里给出相应的输出。例如：

12
9
9
5
*/