/*
7-5 气数已尽
分数 20
作者 Bright
单位 重庆大学
陈同学在教 L 同学下围棋，并刚刚给 TA 讲解了“气”的概念。已知围棋的棋子是下在格点上的。如果棋子 a 在棋子 b 的上、下、左、右相邻的其中一个格点，称这两个棋子是连通的。对于某一种颜色的棋子构成的一个连通块，如果这个连通块中所有棋子的上、下、左、右的未被占据的格点数量之和为 x ，那么称这一块棋子的“气”的数量为 x 。例如，棋盘中间一颗孤立的棋子的“气”为 4 ，棋盘边缘的孤立棋子的“气”为 3 ，棋盘角落的孤立棋子的“气”为 2 。

现在有一个大小为 n×m 的棋盘，上面有若干白色棋子，没有黑色棋子。陈同学想知道，对于棋盘上所有的白色棋子连通块，“气”最少的那个连通块大小及其所具有的“气”的数量。

输入格式:
第一行输入两个正整数 n,m(1≤n,m≤500) ，分别表示棋盘的行数和列数。

接下来 n 行，第 i 行输入一个长度为 m ,仅由字符‘ 0 ’和‘ 1 ’构成的二进制字符串 s 
i1
​
 ,s 
i2
​
 ,⋯,s 
im
​
  ，其中 s 
ij
​
 = 
′
 1 
′
  表示格点 (i,j) 放置了白色棋子， s 
ij
​
 = 
′
 0 
′
  表示格点 (i,j) 是空的，暂未放置棋子。

除此之外，输入保证棋盘上至少有一颗白色棋子。

输出格式:
输出两个整数，分别表示“气”最少的那个白色棋子连通块所包含白色棋子的数量，以及其具有的“气”的数量，空格隔开，结尾没有空格。

输入样例1:
6 6
000000
000000
001100
001100
000000
000000
输出样例1:
4 8
输入样例2:
2 3
110
000
输出样例2:
2 3
输入样例3:
2 2
11
11
输出样例3:
4 0
输入样例4:
4 5
10000
00111
11000
00000
输出样例4:
1 2
输入样例5:
3 3
111
101
111
输出样例5:
8 1
*/
