/*
B 社团纳新（easy）
分数 10
作者 Bright
单位 重庆大学
陈同学是 CQU 的 ACM 社团社长，最近他正在和 L 同学商议关于社团招新的事宜。

学校共有 n 个班级，每个班级都需要进行宣传。陈同学和L同学可以选择去不同的班级宣传，但为了公平起见，他们决定尽量平均分配任务。具体来说：

陈同学将去 ⌊ 
2
n
​
 ⌋ 个班级宣传。
L同学将去剩下的 n−⌊ 
2
n
​
 ⌋ 个班级宣传。

对于第 i 个班级：

如果陈同学去宣传，该班级将有 A 
i
​
  名同学加入社团。

如果 L 同学去宣传，该班级将有 B 
i
​
  加入社团。

陈同学和 L 同学当然希望有尽可能多的学生加入社团，请你帮他们最多能有多少学生加入社团？

输入格式:
第一行一个正整数 n(1≤n≤10 
5
 ) ，表示学校班级的数量。

接下来 n 行，每行用空格隔开的两个正整数 A 
i
​
 ,B 
i
​
 (0≤A 
i
​
 ,B 
i
​
 ≤10 
9
 ) ，分别表示陈同学和 L 同学去第 i 个班级宣传之后，该班级加入社团的学生人数。

输出格式:
输出一个整数，表示最多能加入社团的学生人数。

输入样例:
在这里给出一组输入。例如：

5
10 20
30 40
100 60
90 80
100 110
输出样例:
在这里给出相应的输出。例如：

360
*/