/* 
C 德才论
分数 15
作者 陈丽
单位 浙江大学
宋代史学家司马光在《资治通鉴》中有一段著名的“德才论”：“是故才德全尽谓之圣人，才德兼亡谓之愚人，德胜才谓之君子，才胜德谓之小人。凡取人之术，苟不得圣人，君子而与之，与其得小人，不若得愚人。”

现给出一批考生的德才分数，请根据司马光的理论给出录取排名。

输入格式：
输入第一行给出 3 个正整数，分别为：n（≤10 
5
 ），即考生总数；l（≥60），为录取最低分数线，即德分和才分均不低于 l 的考生才有资格被考虑录取；h（<100），为优先录取线——德分和才分均不低于此线的被定义为“才德全尽”，此类考生按德才总分从高到低排序；才分不到但德分到优先录取线的一类考生属于“德胜才”，也按总分排序，但排在第一类考生之后；德才分均低于 h，但是德分不低于才分的考生属于“才德兼亡”但尚有“德胜才”者，按总分排序，但排在第二类考生之后；其他达到最低线 l 的考生也按总分排序，但排在第三类考生之后。

随后 n 行，每行给出一位考生的信息，包括：准考证号、德分、才分，其中准考证号为 8 位整数，德才分为区间 [0, 100] 内的整数。数字间以空格分隔。

输出格式：
输出第一行首先给出达到最低分数线的考生人数 m，随后 m 行，每行按照输入格式输出一位考生的信息，考生按输入中说明的规则从高到低排序。当某类考生中有多人总分相同时，按其德分降序排列；若德分也并列，则按准考证号的升序输出。

输入样例：
14 60 80
10000001 64 90
10000002 90 60
10000011 85 80
10000003 85 80
10000004 80 85
10000005 82 77
10000006 83 76
10000007 90 78
10000008 75 79
10000009 59 90
10000010 88 45
10000012 80 100
10000013 90 99
10000014 66 60
输出样例：
12
10000013 90 99
10000012 80 100
10000003 85 80
10000011 85 80
10000004 80 85
10000007 90 78
10000006 83 76
10000005 82 77
10000002 90 60
10000014 66 60
10000008 75 79
10000001 64 90






D 最远的距离
分数 15
作者 Bright
单位 重庆大学
给定一个序列 a 
1
​
 ,a 
2
​
 ,…,a 
n
​
  。定义“ CQU 距离”为 cqu(i,j)=∣i 
2
 −j 
2
 ∣+∣a 
i
2
​
 −a 
j
2
​
 ∣。你的任务是计算序列 a 的所有元素对中， CQU 距离的最大值。

形式化地，你需要计算  
1≤i≤n,1≤j≤n
max
​
 cqu(i,j) 。

输入格式:
第一行一个正整数 n (1≤n≤10 
5
 ) ，表示序列的长度。

第二行 n 个整数 a 
1
​
 ,a 
2
​
 ,…,a 
n
​
  (1≤a 
i
​
 ≤10 
9
 ) ，表示给定的序列。

输出格式:
输出一个整数，表示最大距离。

输入样例:
2
4 3
输出样例:
10







E 杂货店店主的烦恼
分数 20
作者 Bright
单位 重庆大学
你是一家杂货店的店主，店里有 n 件商品。第 i 件商品具有重量 w 
i
​
 、初始体积 v 
i
​
  和压缩系数 c 
i
​
 。为了保持店铺整洁，你将所有商品堆成一摞（堆叠的顺序可以由你自由选择，换言之，你可以任意调换所有物品的顺序）。由于商品可以被压缩，假设在商品 i 上方的物品总重量为 W（不包括它自身），那么在堆叠后，第 i 件商品的实际体积将变为：v 
i
​
 −c 
i
​
 ×W。

你的店铺空间非常有限，因此你想要知道所有物品的实际体积之和能达到的最小值。

输入格式:
第一行包含一个整数 n (1≤n≤10 
5
 )，表示商品的数量。 

接下来 n 行，第 i 行包含三个整数 w 
i
​
 ,v 
i
​
 ,c 
i
​
  (1≤w 
i
​
 ≤10 
5
 ,1≤v 
i
​
 ≤10 
12
 ,0≤c 
i
​
 < 
∑w 
i
​
 
v 
i
​
 
​
 )，分别表示第 i 件商品的重量、体积和压缩系数。输入保证每件商品的实际体积在压缩后始终严格大于零。

输出格式:
输出一个整数，表示压缩后所有物品的实际体积之和能达到的最小值。

输入样例:
3
1 8 1
2 9 2
3 10 2
输出样例:
16
样例说明：
从下往上依次放物品 1,2,3 。压缩后，三个物品的实际体积分别为 3,3,10 ，总体积为 16 。可以证明，这是能达到的最小值。








F 跳排序
分数 20
作者 Bright
单位 重庆大学
给定 1∼n 的一个排列 a ，对于某个正整数 x ，可以进行若干次以下操作（可以是 0 次）：

选择距离为 x 的两个下标 i 和 j （即满足 ∣i−j∣=x ），并交换 a[i] 和 a[j] ​。

下面给出 k 组询问，每组询问给出一个正整数 x(1≤x≤n) ，请你判断这个 x 能否将整个序列排成升序。如果可以，输出YES，否则输出NO。

请注意，询问之间是独立的，不会互相影响。

输入格式:
第一行两个正整数 n(1≤n≤10 
5
 ) 和 k(1≤k≤10 
5
 ) ，分别表示排列的长度和询问的个数。

第二行 n 个正整数，表示给定的排列。输入保证是 1∼n 的一个排列。

随后 k 行，每行一个正整数 x(1≤x≤n) ，表示需要你判断能否使整个序列升序的 x 。

输出格式:
输出共 k 行。对于每组询问，输出一行。如果这个 x 能使得整个序列排成升序，输出YES，否则输出NO。

输入样例:
在这里给出一组输入。例如：

4 3
3 2 1 4
1
2
3
输出样例:
在这里给出相应的输出。例如：

YES
YES
NO









G 四数交换排序
分数 20
作者 Bright
单位 重庆大学
给定一个长度为n的序列，序列中的数是1∼n的一个排列。对于每一次操作，你可以选择序列中至多四个数，并任意交换它们的位置。问最少需要多少次操作，能使得整个序列满足升序？

输入格式:
第一行一个正整数n(1≤n≤10 
6
 )，表示序列的长度。

第二行n个正整数，空格隔开，表示给定的序列。输入保证序列是1∼n的一个排列。

输出格式:
输出一个正整数，表示使得序列满足升序的最小操作次数。

输入样例:
在这里给出一组输入。例如：

6
4 2 5 1 3 6
输出样例:
在这里给出相应的输出。例如：

1
*/