/*
E 先輩からのムチ、愛をこめて
分数 20
作者 Bright
单位 重庆大学
为了给拔尖班学生更多的鞭策，学长根据当前的学习状况，为每个同学单独设计了一套练习题，题目的内容和数量都因人而异。每天放学后，学长都会随机抽两个学生留下来，让他们每人各做一道题，不做完不能吃饭！当然，如果被抽到的学生已经把该做的题目都完成了，TA可以直接走人。这样试了几天后，学长发现自己也受到影响，经常吃不到热饭，于是想让你帮他设计一个合理的方案，让所有学生都尽快把该做的题目做完。

输入格式:
第一行一个正整数n(1≤n≤10 
6
 )，表示班级的人数。

第二行n个正整数a[1],a[2],⋯,a[n]，其中1≤a[i]≤10 
6
 表示学长为第i为同学设计的题目数量。

输出格式:
输出一个正整数，表示能够让所有学生把题目做完的最小天数。

输入样例:
3
1 2 3
输出样例:
3
样例说明：
第一天，抽第一个和第三个学生做题；
第二天和第三天，抽第二个和第三个学生做题。

评测用例规模与约定：
对于分值占比25%的测试数据，n≤10,a[i]≤100;

对于分值占比75%的测试数据，n≤10000,a[i]≤100;

对于全部测试数据，n≤10 
6
 ,a[i]≤10 
6
 。
 */